export const answers = [
	{
		question: "Сколько я получу денег за сдачу металлалома?",
		answer: 'Мы являемся официальной организацией с оптовыми ценами на металлолом. Чтобы узнать точную цену на ваш металлолом, вам нужно позвонить по номеру, указанному на сайте. Менеджер выяснит где находится ваш металлолом и нужен ли демонтаж. Далее запросит фото вашего металлолома и даст точную цену. '
	},
	{
		question: "Где ближайший пункт приема металлолома?",
		answer: 'Наш менеджер сообщит вам ближайший пункт приёма металлолома. Все пункты приема металлолома вы можете посмотреть на карте, размещенной на сайте. '
	},
	{
		question: "Как происходит процесс взвешивания?",
		answer: ' Как происходит процесс взвешивания?  \n Взвешивание происходит на ближайшем пункте приёма, либо при объеме вашего металлолома свыше 100т мы можем предоставить выездные весы \tВ случае взвешивания на пункте приёма: 1. Загруженная металлоломом машина заезжает на весы, фиксируется общий вес. 2. Машина выгружается 3. Снова заезжает на весы пустая машина. Разница в весе - ваш вес!'
	},
	{
		question: "Как происходит оплата?",
		answer: 'Оплата происходит на наших пунктах приёма, деньги выдаются сразу без задержек на кассе, либо переводятся вам на карту после процедуры взвешивания с видеофиксацией. '
	},
]