export const metals = [
	{
		id: 1,
		name: "Лом черных металлов",
		price: 14.5
	},
	{
		id: 2,
		name: "Медь (разносортная)",
		price: 770
	},
	{
		id: 3,
		name: "Медь (луженая)",
		price: 550
	},
	{
		id: 4,
		name: "Медь (колонки)",
		price: 550
	},
	{
		id: 5,
		name: "Латунь",
		price: 470
	},
	{
		id: 6,
		name: "Радиаторы",
		price: 470
	},
	{
		id: 7,
		name: "Алюминий  I-1 (электротехнический)",
		price: 170
	},
	{
		id: 8,
		name: "Алюминий  I-1 (пищевой, свыше 40л)",
		price: 165
	},
	{
		id: 9,
		name: "Алюминий АД-31 (профильный)",
		price: 160
	},
	{
		id: 10,
		name: "Алюминий VI (моторный)",
		price: 121
	},
	{
		id: 11,
		name: "Алюминий XIV (разносортный)",
		price: 120
	},
	{
		id: 12,
		name: "Алюминиевые (радиаторы/фольга/жалюзи)",
		price: 70
	},
	{
		id: 13,
		name: "Алюминий (самолётный)",
		price: 40
	},
	{
		id: 14,
		name: "Нержавеющая сталь 8-10%",
		price: 30
	},
	{
		id: 15,
		name: "Свинец (оболочка кабеля)",
		price: 90
	},
	{
		id: 16,
		name: "Свинец (переплав)",
		price: 80
	},
	{
		id: 17,
		name: "Свинец (а/м грузики)",
		price: 60
	},
	{
		id: 18,
		name: "Цинк (карбюраторный, решётки, сантехнический)",
		price: 110
	},
	{
		id: 19,
		name: "Цинк (карбюратор в сборе)",
		price: 100
	},
	{
		id: 20,
		name: "ЗАЗ-блоки",
		price: 50
	},
	{
		id: 21,
		name: "Банка алюминиевая (из-под напитков)",
		price: 80
	},
]