import { metals } from "@/components/MetalTable/metals"

export const buttons = [
	{
		id: 'Черный металл',
		href: '#black metals',
		name: 'Чермет'
	},
	{
		id: 'colored metals',
		href: '#colored metals',
		name: 'Цвет. металлы'
	},
	{
		id: 'slag',
		href: '#slag',
		name: 'Шлак'
	},
	{
		id: 'shavings',
		href: '#shavings',
		name: 'Стружка'
	},
	{
		id: 'cable',
		href: '#cable',
		name: 'Кабель'
	},
	{
		id: 'heat-exchangers',
		href: '#heat-exchangers',
		name: 'Теплообменники'
	},
	{
		id: 'rel',
		href: '#rel',
		name: 'РЭЛ'
	},
	{
		id: 'rzm',
		href: '#rzm',
		name: 'РЗМ'
	},
	
]

export const categories = [
	{
		id: 'black metals',
		name: "Лом черных металлов",
		metals: metals.slice(0,1)
	},
	{
		id: 'colored metals',
		name: "Цветные металлы",
		metals: metals.slice(1,21)
	},
	{
    id: "slag",
    name: "Шлак",
    metals: [
      { id: 1, name: "Шлак медный", price: 35 },
      { id: 2, name: "Шлак латунный", price: 30 },
      { id: 3, name: "Шлак алюминиевый (цена зависит от мет. выхода)", price: 25 },
    ]
  },
  {
    id: "shavings",
    name: "Стружка (засор в зависимости от засоренности)",
    metals: [
      { id: 1, name: "Медная", price: 550 },
      { id: 2, name: "Латунная/бронзовая", price: 300 },
      { id: 3, name: "Алюминиевая", price: 70 },
      { id: 4, name: "Нержавеющая", price: 25 },
    ]
  },
  {
    id: "cable",
    name: "Кабель",
    metals: [
      { id: 1, name: "Кабель медный", price: 215 },
      { id: 2, name: "Кабель медный луженый", price: 180 },
      { id: 3, name: "Кабель алюминиевый", price: 60 },
    ]
  },
  {
    id: "heat-exchangers",
    name: "Теплообменники",
    metals: [
      { id: 1, name: "Чёрная трубка/алюминиевое ребрение", price: 30 },
      { id: 2, name: "Нержавеющая трубка/алюминиевое ребрение", price: 40 },
      { id: 3, name: "Латунная трубка/алюминиевое ребрение", price: 50 },
      { id: 4, name: "Медная трубка/алюминиевое ребрение", price: 60 },
    ]
  },
  {
    id: "rel",
    name: "РЭЛ",
    metals: [
      { id: 1, name: "Платы оперативной памяти с жёлтыми контактами", price: 4150 },
      { id: 2, name: "Платы от мобильных телефонов и планшетов", price: 2950 },
      { id: 3, name: "Платы оперативной памяти с белыми контактами", price: 1950 },
      { id: 4, name: "GSM платы жёлтые", price: 1400 },
      { id: 5, name: "Видео/звуковые/сетевые карты", price: 1250 },
      { id: 6, name: "Процессорные карты", price: 1250 },
      { id: 7, name: "Платы от HDD жестких дисков", price: 1250 },
      { id: 9, name: "Платы терминальные", price: 1250 },
      { id: 10, name: "Платы от CD ROM (в разборе)", price: 1250 },
      { id: 11, name: "Периферийные платы зелёного, красного цвета", price: 730 },
      { id: 12, name: "Платы от игровых автоматов", price: 730 },
      { id: 13, name: "Стенка серверная с жёлтыми разъёмами", price: 730 },
      { id: 14, name: "Материнские платы до Пентиум 4", price: 870 },
      { id: 15, name: "Платы от ноутбуков", price: 870 },
      { id: 16, name: "Серверные платы", price: 870 },
      { id: 17, name: "Материнские платы (нового поколения)", price: 450 },
      { id: 18, name: "Платы сотовых GSM станций (желтые дорожки с двух сторон)", price: 450 },
      { id: 19, name: "Платы телевизионные, радио, бытовые, приборные (МИКС)", price: 380 },
      { id: 20, name: "Платы без сортировки (без мониторных плат)", price: 380 },
      { id: 21, name: "Материнские платы обеднённые", price: 380 },
      { id: 22, name: "Мониторные платы", price: 190 },
      { id: 23, name: "Платы неочищенные", price: 40 },
      { id: 24, name: "Процессоры керамические", price: 17500 },
      { id: 25, name: "Процессоры пластиковые", price: 3400 },
      { id: 26, name: "Процессоры Intel MMX - Black", price: 3400 },
      { id: 27, name: "Процессоры микс (с железными крышками)", price: 810 },
      { id: 28, name: "Электронные детали", price: 460 },
      { id: 29, name: "Мобильные телефоны, смартфоны в сборе", price: 250 },
      { id: 30, name: "Жёсткие диски в сборе", price: 110 },
      { id: 31, name: "Ноутбуки, системные блоки, планшеты в сборе", price: 20 },
      { id: 32, name: "CD-ROM, блоки питания, флоппи дисководы - в сборе", price: 15 },
      { id: 33, name: "Плата (текстолит)", price: 15 },
    ]
  },
  {
    id: "rzm",
    name: "РЗМ",
    metals: [
      // Баббиты
      { id: 1, name: "Баббит Б-83", price: 1850 },
      { id: 2, name: "Баббит Б-80 (содержание Sn не менее 80%)", price: 1100 },
      { id: 3, name: "Баббит Б-50 (содержание Sn не менее 50%)", price: 700 },
      { id: 4, name: "Баббит Б-16", price: 410 },
      { id: 5, name: "Баббит БН", price: 150 },
      
      // Вольфрам
      { id: 6, name: "Вольфрам (лом)", price: 2350 },
      { id: 7, name: "Вольфрам печной", price: 2250 },
      { id: 8, name: "Вольфрам ВНЖ (содержание W не менее 85%)", price: 1750 },
      { id: 9, name: "Вольфрам ВН (содержание W не менее 85%)", price: 1750 },
      { id: 10, name: "Вольфрам ВНК (содержание W не менее 90%)", price: 1150 },
      { id: 11, name: "Вольфрам ВД, ВНД (содержание W не менее 85%)", price: 1150 },
      { id: 12, name: "ВК, ТК без наплавок", price: 1800 },
      { id: 13, name: "ВК, ТК с наплавками", price: 1750 },
      
      // Молибден
      { id: 14, name: "Молибден (лом)", price: 3100 },
      { id: 15, name: "Молибден печной", price: 2800 },
      { id: 16, name: "Молибден стружка", price: 2700 },
      { id: 17, name: "Молибден 80%", price: 1450 },
      
      // Магниты и быстрорезы
      { id: 18, name: "Магниты 24ЮНДК", price: 40 },
      { id: 19, name: "Р18 (без железа)", price: 370 },
      { id: 20, name: "Р6М5, Р6М5К5 (без железа)", price: 220 },
      { id: 21, name: "Р9, Р9К5, Р12, Р6М3, Р6 (без железа)", price: 170 },
      { id: 22, name: "Р3М3", price: 80 },
      { id: 27, name: "Быстрорез микс (с железом)", price: 20 },
      
      // Никель и сплавы
      { id: 23, name: "Никель катодный", price: 780 },
      { id: 24, name: "Никель анодный", price: 760 },
      { id: 25, name: "Никель гранулированный", price: 760 },
      { id: 26, name: "Никель б/у (катоды, аноды)", price: 650 },
      { id: 27, name: "Никель (лом)", price: 650 },
      { id: 28, name: "Х20Н80 (лом)", price: 550 },
      { id: 29, name: "Х15Н60 (лом)", price: 350 },
      { id: 30, name: "Нержавейка Б28 от 18% до 23% Ni (габарит)", price: 120 },
      { id: 31, name: "Нержавейка Б55 от 12% до 13% Ni (габарит)", price: 70 },
      { id: 32, name: "Никельсодержащие от 23% до 98%. Цена руб. за 1% Ni", price: 6 },
      { id: 33, name: "Медно-никелевый сплав МН20 - МН70. Цена руб. за 1% Ni", price: 8 },
      
      // Прочие металлы
      { id: 34, name: "Медь фосфористая", price: 740 },
      { id: 35, name: "Титан (чистый лом)", price: 135 },
      { id: 36, name: "Титан (с клепками, литьё, коланый)", price: 110 },
      { id: 37, name: "Титан (стружка)", price: 100 },
      { id: 38, name: "Олово 01пч", price: 2150 },
      { id: 39, name: "Сурьма", price: 1250 },
      
      // Припои
      { id: 40, name: "Припой Пос 18", price: 340 },
      { id: 41, name: "Припой Пос 30", price: 570 },
      { id: 42, name: "Припой Пос 40", price: 750 },
      { id: 43, name: "Припой Пос 50", price: 930 },
      { id: 44, name: "Припой Пос 60", price: 1120 },
      { id: 45, name: "Припой Пос 70", price: 1380 },
      { id: 46, name: "Припой Пос 90", price: 1700 },
      
      // Ферросплавы
      { id: 47, name: "Феррованадий ФВД50", price: 650 },
      { id: 48, name: "Феррованадий ФВД80", price: 1000 },
      { id: 49, name: "Феррониобий 60, 70 (Бразильский Nb65%)", price: 550 },
      { id: 50, name: "Ферромолибден ФМО60", price: 1700 },
      { id: 51, name: "Ферромолибден ФМО55", price: 1550 },
      { id: 52, name: "Ферросилиций 45", price: 30 },
      { id: 53, name: "Ферромарганец ФМн 70-78", price: 40 },
      { id: 54, name: "Аккум. бат.ТНЖ, ВНЖ, НЖ (железно-никелевые,вес одной банки от 5 кг.)", price: 40 },
      { id: 55, name: "Аккум. бат.ТПНЖ (железно-никелевые), НК(импортные), от 5 кг.", price: 40 },
      { id: 56, name: "Аккум. бат. НК1(никель-кадмиевые, вес одной банки от 5 кг.", price: 40 },
    ]
}
]